app/views/static_pages/secret.html.erb

<div>
	<%= Event.find_by(user_id:current_user.id)%>
---
SELECT  "events".* FROM "events" WHERE "events"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]