app/mailers/invitation_mailer.rb

  def confirmation_inscription_send (invit)
    #on récupère l'instance user pour ensuite pouvoir la passer à la view en @user
    @invit = User.find(invit.user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]