app/views/events/index.html.erb

  <div class="card-body">
    <h5 class="card-title">Auteur: <u> <%=User.find(event.user_id).email%> <%=User.find(event.user_id).last_name%> </u></h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]