app/views/events/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	    <h5 class="card-title">> <%= @event_title %>, Event n°<%= @event_id %></h5>
	    <h6 class="card-subtitle mb-2 text-muted">Auteur: <%=User.find(@event_user_id).email%></h6>