app/controllers/charges_controller.rb

def new
  @amount = Event.find(1).price
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

def create
  # Amount in cents
  @amount = Event.find(1).price
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]