app/controllers/events_controller.rb

INSERT INTO "events" ("title", "description", "start_date", "price", "duration", "location", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT  "events".* FROM "events" ORDER BY "events"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
	def create

		e = Event.create(title: params[:event][:title],
			description: params[:event][:description],
			start_date: params[:event][:start_date],
			duration: params[:event][:duration],
			price: params[:event][:price],
			location: params[:event][:location],
			user_id: current_user.id
		)
		if e.errors.full_messages == []
  		redirect_to event_path(Event.last.id)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
	def edit
		@event_current = Event.find(params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "location" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["location", "Bastille"], ["updated_at", "2019-05-08 00:52:31.948203"], ["id", 4]]
---
	def update
	@event_current = Event.find(params[:id])
	@event_current.update(title: params[:event][:title],
			description: params[:event][:description],
			start_date: params[:event][:start_date],
			duration: params[:event][:duration],
			price: params[:event][:price],
			location: params[:event][:location]
		)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
	def show

	@event_title = Event.find(params[:id]).title
	@event_description = Event.find(params[:id]).description
	@event_date = Event.find(params[:id]).start_date
	@event_duration = Event.find(params[:id]).duration
	@event_price = Event.find(params[:id]).price
	@event_id = Event.find(params[:id]).id
	@event_user_id = Event.find(params[:id]).user_id
	@event_location = Event.find(params[:id]).location