app/controllers/invitations_controller.rb

	def create
	Invitation.create(
			user_id: current_user.id,
			stripe_customer_id: params[:invitation][:stripe_customer_id],
			event_id: Event.find_by(location:params[:invitation][:event_id]).id)
---
INSERT INTO "invitations" ("stripe_customer_id", "user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["stripe_customer_id", "jpmagidddd"], ["user_id", 4], ["event_id", 1], ["created_at", "2019-05-09 16:23:39.376773"], ["updated_at", "2019-05-09 16:23:39.376773"]]
SELECT  "events".* FROM "events" WHERE "events"."location" = $1 LIMIT $2  [["location", "Bastille"], ["LIMIT", 1]]